import TermOfServiceIcon from '@/components/icons/TermOfServiceIcon';

const page = () => {
  return (
    <div className="max-w-[1200px] m-auto flex flex-col gap-6 items-start min-h-[1153px] pt-[48px] px-[120px]">
      <div className="flex items-center gap-1">
        <TermOfServiceIcon />
        <h3 className="text-[22px] font-bold">Үйлчилгээний нөхцөл</h3>
      </div>
      <div className="text-justify text-[18px] leading-[30px]">
        Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
        ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
        худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ. <br />
        Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
        гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
        <br />
        Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
        ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
        худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        <br />
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ. <br />
        <br />
        Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
        гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
        <br />
        <br />
        Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина.
        <br /> Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
        албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
        үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
        зохицуулахад оршино.
        <br /> Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина.
        <br /> Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
        албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
        үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
        зохицуулахад оршино.
        <br /> Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
        үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
        хэрэгжинэ.
        <br /> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
        байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
        тавина.
      </div>
    </div>
  );
};

export default page;
